In [4]:
%load_ext autoreload
%autoreload 2
import pandas as pd

#### pandas - quickstart tutorial - https://pandas.pydata.org/pandas-docs/version/0.15.2/tutorials.html

In [5]:
df = pd.read_csv('teste.csv', delimiter = ',')

In [6]:
df.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [7]:
df.tail()

      animal  uniq_id  water_need
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

##### KAGGLE  - Indexing, selecting, assigning referenceÂ¶ - https://www.kaggle.com/residentmario/indexing-selecting-assigning

In [23]:
df.loc[3:5, 'animal'] # locating by index labes

3    tiger
4    tiger
5    tiger
Name: animal, dtype: object

In [24]:
df.loc[(df.animal =="lion") & (df.water_need > 430) ] #filter

   animal  uniq_id  water_need
16   lion     1017         600
17   lion     1018         500

In [32]:
df.set_index(['uniq_id','animal'])[0:3] #setting new indexes

                  water_need
uniq_id animal
1001    elephant         500
1002    elephant         600
1003    elephant         550

In [34]:
df.loc[df.water_need.notnull()][0:3]

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550

##### KAGGLE  - Summary functions and maps workbook

In [10]:
df.animal.unique()

array(['elephant', 'tiger', 'zebra', 'lion', 'kangaroo'], dtype=object)

In [12]:
df.water_need.median()

325.0

3    tiger
4    tiger
5    tiger
Name: animal, dtype: object

   animal  uniq_id  water_need
16   lion     1017         600
17   lion     1018         500